In [1]:
import pandas as pd

### DataFrame索引和切片

In [2]:
df = pd.DataFrame({'one':[1,2,3,4], 'two':[4,3,2,1]}, index=['a','b','c','d'])
df

   one  two
a    1    4
b    2    3
c    3    2
d    4    1

In [3]:
df['one']

a    1
b    2
c    3
d    4
Name: one, dtype: int64

In [4]:
df['one']['a'] # 用双中括号：先选列再选行

1

In [5]:
df.loc['a', 'one'] # 用loc()方法

1

In [6]:
df.loc['a',:]

one    1
two    4
Name: a, dtype: int64

In [7]:
df.loc['a',]

one    1
two    4
Name: a, dtype: int64

In [8]:
df.loc[['a','c'], :]

   one  two
a    1    4
c    3    2

In [9]:
df.loc[['a','c'], 'two']

a    4
c    2
Name: two, dtype: int64

### DataFrame数据对齐和缺失数据处理

In [10]:
df1 = pd.DataFrame({'one':pd.Series([1,2,3],index=['a','b','c']), 'two':pd.Series([1,2,3,4],index=['b','a','c','d'])})
df1

   one  two
a  1.0    2
b  2.0    1
c  3.0    3
d  NaN    4

In [13]:
df = pd.DataFrame({'two':[1,2,3,4], 'one':[4,5,6,7]}, index=['c','d','b','a'])
df

   two  one
c    1    4
d    2    5
b    3    6
a    4    7

In [14]:
df + df1

   one  two
a  8.0    6
b  8.0    4
c  7.0    4
d  NaN    6

In [15]:
df1

   one  two
a  1.0    2
b  2.0    1
c  3.0    3
d  NaN    4

In [16]:
df1.fillna(0)

   one  two
a  1.0    2
b  2.0    1
c  3.0    3
d  0.0    4

In [17]:
df1.dropna() # 删掉了有NaN的一整行

   one  two
a  1.0    2
b  2.0    1
c  3.0    3

In [18]:
import numpy as np

In [21]:
df1.loc['d', 'two'] = np.nan
df1.loc['c', 'two'] = np.nan
df1

   one  two
a  1.0  2.0
b  2.0  1.0
c  3.0  NaN
d  NaN  NaN

In [22]:
df1.dropna(how='all') # 只会drop掉所有值都为NaN的那一行

   one  two
a  1.0  2.0
b  2.0  1.0
c  3.0  NaN

In [23]:
df1.dropna()

   one  two
a  1.0  2.0
b  2.0  1.0

In [27]:
df.loc['c', 'one'] = np.nan
df

   two  one
c    1  NaN
d    2  5.0
b    3  6.0
a    4  7.0

In [29]:
df.dropna(axis=1) # 按照列来drop缺失数据（axis=0指行【默认】，axis=1指列）

   two
c    1
d    2
b    3
a    4